### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_app_service_virtual_network_swift_connection.azure_vnet_connection[0] will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "azure_vnet_connection" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # azurerm_application_insights.INSIGHTS will be created
+   resource "azurerm_application_insights" "INSIGHTS" {
+       app_id                                = (known after apply)
+       application_type                      = "web"
+       connection_string                     = (sensitive value)
+       daily_data_cap_in_gb                  = (known after apply)
+       daily_data_cap_notifications_disabled = (known after apply)
+       disable_ip_masking                    = false
+       force_customer_storage_for_profiler   = false
+       id                                    = (known after apply)
+       instrumentation_key                   = (sensitive value)
+       internet_ingestion_enabled            = true
+       internet_query_enabled                = true
+       local_authentication_disabled         = false
+       location                              = "uksouth"
+       name                                  = "demo-inf-dev-insights"
+       resource_group_name                   = "Demo-Inf-Dev-Rg"
+       retention_in_days                     = 90
+       sampling_percentage                   = 100
    }

  # azurerm_container_registry.ACR will be created
+   resource "azurerm_container_registry" "ACR" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "uksouth"
+       login_server                  = (known after apply)
+       name                          = "demoinfdevacr"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = [
+           {
+               default_action  = "Deny"
+               ip_rule         = [
+                   {
+                       action   = (known after apply)
+                       ip_range = (known after apply)
                    },
                ]
+               virtual_network = [
+                   {
+                       action    = "Allow"
+                       subnet_id = (known after apply)
                    },
                ]
            },
        ]
+       public_network_access_enabled = true
+       resource_group_name           = "Demo-Inf-Dev-Rg"
+       retention_policy              = (known after apply)
+       sku                           = "Premium"
+       trust_policy                  = (known after apply)
+       zone_redundancy_enabled       = false

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }
    }

  # azurerm_linux_web_app.APPSVC will be created
+   resource "azurerm_linux_web_app" "APPSVC" {
+       app_settings                      = (sensitive)
+       client_affinity_enabled           = false
+       client_certificate_enabled        = false
+       client_certificate_mode           = "Required"
+       custom_domain_verification_id     = (sensitive value)
+       default_hostname                  = (known after apply)
+       enabled                           = true
+       https_only                        = true
+       id                                = (known after apply)
+       key_vault_reference_identity_id   = (known after apply)
+       kind                              = (known after apply)
+       location                          = "uksouth"
+       name                              = "demo-inf-dev-linux-appsvc"
+       outbound_ip_address_list          = (known after apply)
+       outbound_ip_addresses             = (known after apply)
+       possible_outbound_ip_address_list = (known after apply)
+       possible_outbound_ip_addresses    = (known after apply)
+       resource_group_name               = "Demo-Inf-Dev-Rg"
+       service_plan_id                   = (known after apply)
+       site_credential                   = (known after apply)

+       auth_settings {
+           additional_login_parameters    = (known after apply)
+           allowed_external_redirect_urls = (known after apply)
+           default_provider               = (known after apply)
+           enabled                        = (known after apply)
+           issuer                         = (known after apply)
+           runtime_version                = (known after apply)
+           token_refresh_extension_hours  = (known after apply)
+           token_store_enabled            = (known after apply)
+           unauthenticated_client_action  = (known after apply)

+           active_directory {
+               allowed_audiences          = (known after apply)
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
            }

+           facebook {
+               app_id                  = (known after apply)
+               app_secret              = (sensitive value)
+               app_secret_setting_name = (known after apply)
+               oauth_scopes            = (known after apply)
            }

+           github {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           google {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           microsoft {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           twitter {
+               consumer_key                 = (known after apply)
+               consumer_secret              = (sensitive value)
+               consumer_secret_setting_name = (known after apply)
            }
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = true
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           health_check_eviction_time_in_min       = (known after apply)
+           http2_enabled                           = false
+           ip_restriction                          = (known after apply)
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction                      = (known after apply)
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image     = "demoinfdevacr.azurecr.io/demo-inf-dev-linux-appsvc"
+               docker_image_tag = "latest"
            }
        }
    }

  # azurerm_network_security_group.NSG["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "App-Service-Integration-Subnet-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_network_security_group.NSG["Subnet0"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Subnet0-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_network_security_group.NSG["Subnet1"] will be created
+   resource "azurerm_network_security_group" "NSG" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Subnet1-nsg"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       security_rule       = (known after apply)
    }

  # azurerm_resource_group.RG will be created
+   resource "azurerm_resource_group" "RG" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Demo-Inf-Dev-Rg"
    }

  # azurerm_role_assignment.role_assigment will be created
+   resource "azurerm_role_assignment" "role_assigment" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.ASP will be created
+   resource "azurerm_service_plan" "ASP" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "uksouth"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "demo-inf-dev-asp"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "Demo-Inf-Dev-Rg"
+       sku_name                     = "S1"
+       worker_count                 = (known after apply)
    }

  # azurerm_subnet.SUBNETS["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.2.0/27",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "App-Service-Integration-Subnet"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       service_endpoints                              = [
+           "Microsoft.ContainerRegistry",
        ]
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"

+       delegation {
+           name = "delegated-appservice"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
+                   "Microsoft.Network/virtualNetworks/subnets/join/action",
+                   "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
+                   "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.SUBNETS["Subnet0"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Subnet0"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"
    }

  # azurerm_subnet.SUBNETS["Subnet1"] will be created
+   resource "azurerm_subnet" "SUBNETS" {
+       address_prefixes                               = [
+           "10.2.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Subnet1"
+       resource_group_name                            = "Demo-Inf-Dev-Rg"
+       virtual_network_name                           = "Demo-Inf-Dev-Vnet"
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["App-Service-Integration-Subnet"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet0"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_subnet_assoc["Subnet1"] will be created
+   resource "azurerm_subnet_network_security_group_association" "nsg_subnet_assoc" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.VNET will be created
+   resource "azurerm_virtual_network" "VNET" {
+       address_space       = [
+           "10.2.0.0/16",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "Demo-Inf-Dev-Vnet"
+       resource_group_name = "Demo-Inf-Dev-Rg"
+       subnet              = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```
</details>